In [1]:
import numpy as np
import pandas as pd

## DataFrame 생성하기

- 행과 열의 자료구조 (series의 집합)
- 파이썬계의 엑셀 -> 테이블 구조

- 딕셔너리로 데이터프레임 생성
- dataFrameVar = pd.DataFrame({key1:[value1,value2...],...})

In [2]:
df1 = pd.DataFrame({'a':[10,23,45], 'b':[56,23,45], 'c':[10,23,50]})
df1

    a   b   c
0  10  56  10
1  23  23  23
2  45  45  50

In [3]:
# 자료구조 확인 
type(df1)

pandas.core.frame.DataFrame

In [4]:
# a 컬럼의 데이터 형과 자료구조 확인
print(df1['a'].dtype, type(df1['a']))

int64 <class 'pandas.core.series.Series'>

In [5]:
# 전체 행수 
len(df1)

3

In [6]:
# a컬럼만 추출하기 
df1['a']

0    10
1    23
2    45
Name: a, dtype: int64

## DataFrame의 속성

- dataFrame.values : 값만 추출
- dataFrame.index : 인덱스만 추출
- dataFrame.columns : 컬럼명만 추출 
- dataFrame.index.name : 인덱스 이름 지정
- dataFrame.columns.name : 컬럼 이름 지정

In [7]:
df2= pd.DataFrame({
       "name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
       "year":[2014, 2015, 2016, 2017, 2018],
       "points":[1.5, 1.7, 3.6, 2.5, 2.9]
     })
df2

      name  year  points
0    Elise  2014     1.5
1    Julia  2015     1.7
2     Jhon  2016     3.6
3  Charles  2017     2.5
4  Charles  2018     2.9

In [8]:
df2.index.name='Student ID'
df2.columns.name='Student Info'
df2

Student Info     name  year  points
Student ID
0               Elise  2014     1.5
1               Julia  2015     1.7
2                Jhon  2016     3.6
3             Charles  2017     2.5
4             Charles  2018     2.9

In [9]:
df2.index

RangeIndex(start=0, stop=5, step=1, name='Student ID')

In [10]:
df2.columns

Index(['name', 'year', 'points'], dtype='object', name='Student Info')

## 데이타프레임 <- 이중구조의 딕셔너리

- 딕셔너리 정의 { key 1: {key2-1:value1. key2-2:value2 … }}
- 데이타프레임이름 = pd.DataFrame(딕셔너리이름)

In [11]:
# 이중 딕셔너리 정의 
myDict = {'col1':{2015:10,2016:20},'col2':{2015:45,2016:55,2017:27} }
myDict

{'col1': {2015: 10, 2016: 20}, 'col2': {2015: 45, 2016: 55, 2017: 27}}

In [12]:
df3 = pd.DataFrame(myDict)
df3

      col1  col2
2015  10.0    45
2016  20.0    55
2017   NaN    27

In [13]:
# 컬럼명과 인덱스명 재정의 
df3.columns=['col11','col22']
df3.index= [15, 16, 17]
df3

    col11  col22
15   10.0     45
16   20.0     55
17    NaN     27

## 데이타프레임의 정보 확인

- dataFrameVar.head() : 5개 추출
- dataFrameVar.head(number) : number 갯수만큼 추출
- dataFrameVar.tail() : 뒷부분 기준으로 5개 추출
- dataFrameVar.tail(number) : 뒷부분 기준으로 number 갯수만큼 추출
- dataFrameVar.describe()
- dataFrameVar.info()
- dataFrameVar.shape

In [14]:
# 랜덤값을 이용해서 데이타프레임 생성하기 
df4 = pd.DataFrame(np.random.randn(3,4))
df4

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [15]:
df4.shape

(3, 4)

In [16]:
# shift + Tab
df4.head()

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [17]:
df4.head(2)

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964

In [18]:
df4.tail()

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [19]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
0    3 non-null float64
1    3 non-null float64
2    3 non-null float64
3    3 non-null float64
dtypes: float64(4)
memory usage: 176.0 bytes

In [20]:
# 총 갯수, 평균, 평균분산, 최소값, 분기수, 최대값
df4.describe()

              0         1         2         3
count  3.000000  3.000000  3.000000  3.000000
mean  -0.990593  0.097350  0.360426 -0.026575
std    0.908243  0.751726  2.086205  2.346677
min   -1.916415 -0.614384 -2.047639 -1.760486
25%   -1.435381 -0.295739 -0.269728 -1.361725
50%   -0.954348  0.022905  1.508184 -0.962964
75%   -0.527681  0.453217  1.564459  0.840381
max   -0.101015  0.883529  1.620734  2.643726

In [21]:
df4.mean()

0   -0.990593
1    0.097350
2    0.360426
3   -0.026575
dtype: float64

In [22]:
df4

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

## DataFrame 복사

- DataFrame 데이터를 복사할 때 '='기호를 사용하면 데이터위치만 복사한다.
- 그러므로 원본데이터는 하나이다.
- 데이터 내용까지 복사하려면 copy()를 사용한다.

In [23]:
df4_2 = df4.copy()
df4_2

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [24]:
df4_2.iloc[0,0] = 10
df4_2

           0         1         2         3
0  10.000000  0.022905  1.508184  2.643726
1  -0.101015  0.883529  1.620734 -0.962964
2  -0.954348 -0.614384 -2.047639 -1.760486

In [25]:
df4

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

## 열 필터링

 - dataFrameVar.colName
 - dataFrameVar[colName]
 - dataFrameVar[[colName1, colName2 ...]]

In [26]:
df4

          0         1         2         3
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [27]:
df4.columns = ['col1','col2','col3','col4']
df4

       col1      col2      col3      col4
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964
2 -0.954348 -0.614384 -2.047639 -1.760486

In [28]:
df4.col1

0   -1.916415
1   -0.101015
2   -0.954348
Name: col1, dtype: float64

In [29]:
df4['col1']

0   -1.916415
1   -0.101015
2   -0.954348
Name: col1, dtype: float64

In [30]:
# 한 개의 컬럼을 추출할때는 Series로 보여준다.
type(df4['col1'])

pandas.core.series.Series

In [31]:
# 다중으로 컬럼을 추출시에는 [[ ... ]] 를 사용한다. 
df4[['col1','col3']]

       col1      col3
0 -1.916415  1.508184
1 -0.101015  1.620734
2 -0.954348 -2.047639

In [32]:
# 다중으로 컬럼을 추출시에는 DataFrame으로 보여준다. 
type(df4[['col1','col3']])

pandas.core.frame.DataFrame

In [33]:
# 컬럼을 인덱스로 접근할 수는 없다.
# df4[0], df4[:, 0:2]
df4[:2]

       col1      col2      col3      col4
0 -1.916415  0.022905  1.508184  2.643726
1 -0.101015  0.883529  1.620734 -0.962964

In [34]:
data = {"name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
       "year":[2014, 2015, 2016, 2017, 2018],
       "points":[1.5, 1.7, 3.6, 2.5, 2.9]}

# 데이타프레임 재정의 
df = pd.DataFrame(data, columns=["year", "name", "points"], 
                    index=["one", "two", "three", "four", "five"])
df

       year     name  points
one    2014    Elise     1.5
two    2015    Julia     1.7
three  2016     Jhon     3.6
four   2017  Charles     2.5
five   2018  Charles     2.9

## 새로운 컬럼 추가하기

- dataframeVar[newColumn] = value

In [35]:
# 동일한 값 입력 
df['penalty']= 0.5
df

       year     name  points  penalty
one    2014    Elise     1.5      0.5
two    2015    Julia     1.7      0.5
three  2016     Jhon     3.6      0.5
four   2017  Charles     2.5      0.5
five   2018  Charles     2.9      0.5

In [36]:
# 리스트로 새로운 컬럼값 구성 
df['penalty2']= [12, 20, 30, 45, 55]
df

       year     name  points  penalty  penalty2
one    2014    Elise     1.5      0.5        12
two    2015    Julia     1.7      0.5        20
three  2016     Jhon     3.6      0.5        30
four   2017  Charles     2.5      0.5        45
five   2018  Charles     2.9      0.5        55

In [37]:
# 리스트로 새로운 컬럼값 구성 - 에러 발생 
# ValueError: Length of values does not match length of index
# df['penalty3']= [12, 20]

In [38]:
# 넘파이배열을 컬럼의 값으로 이용 
df['id'] = np.arange(1,6)
df

       year     name  points  penalty  penalty2  id
one    2014    Elise     1.5      0.5        12   1
two    2015    Julia     1.7      0.5        20   2
three  2016     Jhon     3.6      0.5        30   3
four   2017  Charles     2.5      0.5        45   4
five   2018  Charles     2.9      0.5        55   5

In [39]:
# 넘파이 랜덤 배열을 새로운 컬럼의 값으로 이용 
df['random']=np.random.randn(5)
df

       year     name  points  penalty  penalty2  id    random
one    2014    Elise     1.5      0.5        12   1  1.198093
two    2015    Julia     1.7      0.5        20   2 -0.907431
three  2016     Jhon     3.6      0.5        30   3 -0.720438
four   2017  Charles     2.5      0.5        45   4 -1.515298
five   2018  Charles     2.9      0.5        55   5  1.496092

## 시리즈를 이용해서 새로운 컬럼값 구성

In [40]:
# 시리즈 생성 
age_data = pd.Series([22, 25, 22], index=['one','two','four'])
age_data

one     22
two     25
four    22
dtype: int64

In [41]:
# 시리즈를 새 컬럼값으로 대입 
# 같은 인덱스에 해당하는 값으로 삽입된다. 

df['age'] = age_data
df

       year     name  points  penalty  penalty2  id    random   age
one    2014    Elise     1.5      0.5        12   1  1.198093  22.0
two    2015    Julia     1.7      0.5        20   2 -0.907431  25.0
three  2016     Jhon     3.6      0.5        30   3 -0.720438   NaN
four   2017  Charles     2.5      0.5        45   4 -1.515298  22.0
five   2018  Charles     2.9      0.5        55   5  1.496092   NaN

## 기존 컬럼을 이용한 새로운 컬럼 생성

In [42]:
df['points2'] = df['points']*10
df

       year     name  points  penalty  penalty2  id    random   age  points2
one    2014    Elise     1.5      0.5        12   1  1.198093  22.0     15.0
two    2015    Julia     1.7      0.5        20   2 -0.907431  25.0     17.0
three  2016     Jhon     3.6      0.5        30   3 -0.720438   NaN     36.0
four   2017  Charles     2.5      0.5        45   4 -1.515298  22.0     25.0
five   2018  Charles     2.9      0.5        55   5  1.496092   NaN     29.0

In [43]:
# 컬럼값에 조건식 이용하기 
df['pass'] = df['points'] > 2.0
df

,year,name,points,penalty,penalty2,id,random,age,points2,pass
one,2014,Elise,1.5,0.5,12,1,1.198093,22.0,15.0,False
two,2015,Julia,1.7,0.5,20,2,-0.907431,25.0,17.0,False
three,2016,Jhon,3.6,0.5,30,3,-0.720438,NaN,36.0,True
four,2017,Charles,2.5,0.5,45,4,-1.515298,22.0,25.0,True
five,2018,Charles,2.9,0.5,55,5,1.496092,NaN,29.0,True

## 컬럼 삭제하기

- del dataFrameVar[columnName]

In [44]:
del df['random']
df

       year     name  points  penalty  penalty2  id   age  points2   pass
one    2014    Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015    Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016     Jhon     3.6      0.5        30   3   NaN     36.0   True
four   2017  Charles     2.5      0.5        45   4  22.0     25.0   True
five   2018  Charles     2.9      0.5        55   5   NaN     29.0   True

## 다중행 추출

- dataframeName[startIndex:endIndex]

In [45]:
# 1행만 추출 
df['one':'one']

     year   name  points  penalty  penalty2  id   age  points2   pass
one  2014  Elise     1.5      0.5        12   1  22.0     15.0  False

In [46]:
# 1~3행만 추출 
df['one':'three']

       year   name  points  penalty  penalty2  id   age  points2   pass
one    2014  Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015  Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016   Jhon     3.6      0.5        30   3   NaN     36.0   True

In [47]:
#  숫자 인덱스 
df[0:2]

     year   name  points  penalty  penalty2  id   age  points2   pass
one  2014  Elise     1.5      0.5        12   1  22.0     15.0  False
two  2015  Julia     1.7      0.5        20   2  25.0     17.0  False

## 컬럼추출

In [48]:
df.year

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [49]:
df['year']

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [50]:
df[['year','name']]

       year     name
one    2014    Elise
two    2015    Julia
three  2016     Jhon
four   2017  Charles
five   2018  Charles

## Dataframe : 행 추출. loc 이용

- 데이타프레임이름.loc[start:end]
- 인덱스는 인덱스행이름으로만 가능

In [51]:
df

       year     name  points  penalty  penalty2  id   age  points2   pass
one    2014    Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015    Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016     Jhon     3.6      0.5        30   3   NaN     36.0   True
four   2017  Charles     2.5      0.5        45   4  22.0     25.0   True
five   2018  Charles     2.9      0.5        55   5   NaN     29.0   True

In [52]:
df.loc['three':'four']

       year     name  points  penalty  penalty2  id   age  points2  pass
three  2016     Jhon     3.6      0.5        30   3   NaN     36.0  True
four   2017  Charles     2.5      0.5        45   4  22.0     25.0  True

## Dataframe : 컬럼 추출. loc 이용

- dataFrameVar.loc[:, colName ]
- dataFrameVar.loc[:, colName1:colName2 ]

In [53]:
# 한개의 컬럼만 추출
df.loc[:,'name']

one        Elise
two        Julia
three       Jhon
four     Charles
five     Charles
Name: name, dtype: object

In [54]:
# 다중 컬럼 추출
df.loc[:,'name':'points']

          name  points
one      Elise     1.5
two      Julia     1.7
three     Jhon     3.6
four   Charles     2.5
five   Charles     2.9

In [55]:
df.loc['three':'four', 'name':'penalty']

          name  points  penalty
three     Jhon     3.6      0.5
four   Charles     2.5      0.5

## 행과 열 추출 - iloc 이용

- iloc[ row1:row2, column1:column2]
- 숫자인덱스로 접근

In [56]:
df

       year     name  points  penalty  penalty2  id   age  points2   pass
one    2014    Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015    Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016     Jhon     3.6      0.5        30   3   NaN     36.0   True
four   2017  Charles     2.5      0.5        45   4  22.0     25.0   True
five   2018  Charles     2.9      0.5        55   5   NaN     29.0   True

In [57]:
# 1행 추출
df.iloc[0]

year         2014
name        Elise
points        1.5
penalty       0.5
penalty2       12
id              1
age            22
points2        15
pass        False
Name: one, dtype: object

In [58]:
# 1열 추출
df.iloc[:,0]

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [59]:
# 1~3행 추출 
df.iloc[0:3]

       year   name  points  penalty  penalty2  id   age  points2   pass
one    2014  Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015  Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016   Jhon     3.6      0.5        30   3   NaN     36.0   True

In [60]:
# 3~5 열 추출
df.iloc[:, 2:5]

       points  penalty  penalty2
one       1.5      0.5        12
two       1.7      0.5        20
three     3.6      0.5        30
four      2.5      0.5        45
five      2.9      0.5        55

In [61]:
df.iloc[0:2, 0:3]

     year   name  points
one  2014  Elise     1.5
two  2015  Julia     1.7

## loc 이용해서 행 추가하기

- 데이타프레임이름.loc [ 행인덱스명, : ] = [값1, 값2 ...]

In [62]:
df

       year     name  points  penalty  penalty2  id   age  points2   pass
one    2014    Elise     1.5      0.5        12   1  22.0     15.0  False
two    2015    Julia     1.7      0.5        20   2  25.0     17.0  False
three  2016     Jhon     3.6      0.5        30   3   NaN     36.0   True
four   2017  Charles     2.5      0.5        45   4  22.0     25.0   True
five   2018  Charles     2.9      0.5        55   5   NaN     29.0   True

In [63]:
df.loc['six',:]=[2019, 'Hidi', 4.5, 2.0, 33, 6, 33, 30, False]
df

         year     name  points  penalty  penalty2   id   age  points2   pass
one    2014.0    Elise     1.5      0.5      12.0  1.0  22.0     15.0  False
two    2015.0    Julia     1.7      0.5      20.0  2.0  25.0     17.0  False
three  2016.0     Jhon     3.6      0.5      30.0  3.0   NaN     36.0   True
four   2017.0  Charles     2.5      0.5      45.0  4.0  22.0     25.0   True
five   2018.0  Charles     2.9      0.5      55.0  5.0   NaN     29.0   True
six    2019.0     Hidi     4.5      2.0      33.0  6.0  33.0     30.0  False

## Dataframe : loc 이용. 열 추가

- 데이타프레임이름.loc [ :, 열인덱스명 ] = [값1, 값2 ...]

In [64]:
df.loc[:, 'pass2'] = False
df

,year,name,points,penalty,penalty2,id,age,points2,pass,pass2
one,2014.0,Elise,1.5,0.5,12.0,1.0,22.0,15.0,False,False
two,2015.0,Julia,1.7,0.5,20.0,2.0,25.0,17.0,False,False
three,2016.0,Jhon,3.6,0.5,30.0,3.0,NaN,36.0,True,False
four,2017.0,Charles,2.5,0.5,45.0,4.0,22.0,25.0,True,False
five,2018.0,Charles,2.9,0.5,55.0,5.0,NaN,29.0,True,False
six,2019.0,Hidi,4.5,2.0,33.0,6.0,33.0,30.0,False,False

## Boolean Index

- 조건에 맞으면 결과값이 True/False 형태의 Boolean으로 표시
- dataFrame[BooleanIndex조건식]

In [65]:
data = { "year":[2014, 2015, 2016, 2015, 2017,2013]
        ,"name":['Haidi', 'Haidi', 'Haidi', 'Charles', 'Charles',  'Hayoung']
        , "points":[1.5, 1.7, 3.6, 2.5, 2.9, 4.0]
        , "penalty":[0.1,0.2, 0.3,0.4,0.5,0.1 ]
        , "net_points":[1.4,1.5,3.3,2.1,2.4,2.1]
        , "bonus":[10,20,30,40,50,60]}
df2 = pd.DataFrame(data, 
         columns=["year","name","points","penalty","net_points","bonus"],
         index=["one", "two", "three", "four", "five","six"])
df2

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [66]:
# year 컬럼에서 2014 보다 큰 데이터값 Boolean Index
df2['year']> 2014

one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [67]:
# year 컬럼의 데이타값이 2014보다 큰 행 추출 
df2[df2['year']> 2014]

       year     name  points  penalty  net_points  bonus
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50

In [68]:
df2['name'] == 'Haidi'

one       True
two       True
three     True
four     False
five     False
six      False
Name: name, dtype: bool

In [69]:
# name 컬럼의 데이타값이 'Haidi'인 행 추출
df2[df2['name'] == 'Haidi']

       year   name  points  penalty  net_points  bonus
one    2014  Haidi     1.5      0.1         1.4     10
two    2015  Haidi     1.7      0.2         1.5     20
three  2016  Haidi     3.6      0.3         3.3     30

In [70]:
df2['name'] != 'Haidi'

one      False
two      False
three    False
four      True
five      True
six       True
Name: name, dtype: bool

In [71]:
# name 컬럼의 데이타값이 'Haidi'가 아닌 행 추출
df2[df2['name'] != 'Haidi']

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50
six   2013  Hayoung     4.0      0.1         2.1     60

In [72]:
df2

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [73]:
# | or , & and
(df2['name']=='Charles') | (df2['name']=='Haidi')

one       True
two       True
three     True
four      True
five      True
six      False
Name: name, dtype: bool

In [74]:
# name 컬럼값이 'Charles'이거나 'Haidi' 인 행 추출
df2[(df2['name']=='Charles') | (df2['name']=='Haidi')]

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50

## 퀴즈

- df2 데이타프레임에서 bonus 데이값이 30~50 사이의 행을 추출하여라
- Boolean Index 이용

In [75]:
df2

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [76]:
df2[(df2['bonus']>=30) & (df2['bonus']<= 50)]

       year     name  points  penalty  net_points  bonus
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50

## Boolean Index 를 loc와 함께 적용하기

- dataFrameVar.loc[Boolean Index조건식, [columnName1, columnName2 ...]]

In [77]:
df2['name'] == 'Charles'

one      False
two      False
three    False
four      True
five      True
six      False
Name: name, dtype: bool

In [78]:
# name 컬럼값이 'Charles'인 모든 행의 모든 열 
df2.loc[df2['name'] == 'Charles', :]

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50

In [79]:
# name 컬럼값이 'Charles'인 모든 행의 points 컬럼만 추출
df2.loc[df2['name'] == 'Charles', 'points']

four    2.5
five    2.9
Name: points, dtype: float64

In [80]:
# name 컬럼값이 'Charles'인 모든 행의 name, points 컬럼만 추출
df2.loc[df2['name'] == 'Charles', ['name','points']]

         name  points
four  Charles     2.5
five  Charles     2.9

In [81]:
df2

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [82]:
df2['net_points'] < 2

one       True
two       True
three    False
four     False
five     False
six      False
Name: net_points, dtype: bool

In [83]:
df2.loc[df2['net_points'] < 2, :]

     year   name  points  penalty  net_points  bonus
one  2014  Haidi     1.5      0.1         1.4     10
two  2015  Haidi     1.7      0.2         1.5     20

In [84]:
## net_points 컬럼값이 2보다 작다면 0으로 대체 
df2.loc[df2['net_points'] < 2, 'net_points'] = 0
df2

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         0.0     10
two    2015    Haidi     1.7      0.2         0.0     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

## np.nan : 결측값

In [85]:
df3 = pd.DataFrame(np.random.randn(4,4))
df3

          0         1         2         3
0  1.008977 -1.566315 -0.070616  1.288953
1 -0.113892 -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454 -0.512269

In [86]:
#  1행은 모두 결측값으로 대입
df3.loc[0, :] = np.nan
df3

          0         1         2         3
0       NaN       NaN       NaN       NaN
1 -0.113892 -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454 -0.512269

In [87]:
# 특정 인덱스에 결측값 삽입하기 
df3.loc[1, 0] = np.nan
df3.loc[3, 3] = np.nan
df3

          0         1         2         3
0       NaN       NaN       NaN       NaN
1       NaN -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454       NaN

## dropna()로 결측값이 들어있는 행 삭제하기

- 데이타프레임이름.dropna(how="all") : NaN 값이 모두 들어있는 행 삭제하기
- 데이타프레임이름.dropna(how="any") : NaN 값이 하나라도 들어있는 행 삭제하기
- 실제적으로 삭제 명령이 적용되지 않으므로 기존 데이타프레임에 다시 대입한다.
- 데이타프레임이름 = 데이타프레임이름.dropna(how="any/all")

In [88]:
df3

          0         1         2         3
0       NaN       NaN       NaN       NaN
1       NaN -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454       NaN

In [89]:
df3.dropna(how='any')

          0         1         2         3
2 -0.094834 -0.937571  0.011536  0.116756

In [90]:
df3

          0         1         2         3
0       NaN       NaN       NaN       NaN
1       NaN -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454       NaN

In [91]:
df3 = df3.dropna(how='all')

In [92]:
df3

          0         1         2         3
1       NaN -0.549274  0.509798 -0.743401
2 -0.094834 -0.937571  0.011536  0.116756
3 -1.225238  0.337792  0.720454       NaN

## fillna()를 이용해서 결측값에 특정값 삽입하기

- dataFrameVar.fillna(value=값)
- 실제적으로 교체 명령이 적용되지 않으므로 기존 데이타프레임에 다시 대입한다.
- 데이타프레임이름 = 데이타프레임이름.fillna(value=값)

In [93]:
data = {"a":[2,np.NAN,3],
        "b":[np.NAN,np.NAN,np.NAN],
        "c":[1,np.NAN,np.NAN]}
df4 = pd.DataFrame(data)
df4

     a   b    c
0  2.0 NaN  1.0
1  NaN NaN  NaN
2  3.0 NaN  NaN

In [94]:
# NaN 값 0 으로 변경 
df4 = df4.fillna(value=0)

In [95]:
df4

     a    b    c
0  2.0  0.0  1.0
1  0.0  0.0  0.0
2  3.0  0.0  0.0

## isnull()

- dataFrameVar.isnull() 
- NaN 값에 True

In [96]:
data = {"a":[2,np.NAN,3],
        "b":[np.NAN,np.NAN,np.NAN],
        "c":[1,np.NAN,np.NAN]}
df5 = pd.DataFrame(data)
df5

     a   b    c
0  2.0 NaN  1.0
1  NaN NaN  NaN
2  3.0 NaN  NaN

In [97]:
df5.isnull()

       a     b      c
0  False  True  False
1   True  True   True
2  False  True   True

## notnull()

- dataFrameVar.notnull() 
- NaN 값에 False

In [98]:
df5

     a   b    c
0  2.0 NaN  1.0
1  NaN NaN  NaN
2  3.0 NaN  NaN

In [99]:
df5.notnull()

       a      b      c
0   True  False   True
1  False  False  False
2   True  False  False

## NaN 값이 들어있는 셀의 행 추출하기

- 데이타프레임.loc[데이타프레임.isnull()[NaN값이 있는 열], :]

In [100]:
df5

     a   b    c
0  2.0 NaN  1.0
1  NaN NaN  NaN
2  3.0 NaN  NaN

In [101]:
# a 열의 데이터 값이 NaN인 행만 추출 
df5.loc[df5.isnull()['a'],:]

    a   b   c
1 NaN NaN NaN

In [102]:
# c 열에서 데이터 값이 NaN인 행만 추출 
df5.loc[df5.isnull()['c'],:]

     a   b   c
1  NaN NaN NaN
2  3.0 NaN NaN

## drop()을 이용한 행과 열 삭제

- dataFrameVar.drop([rowIndex1, rowIndex2 ...]) : 행
- dataFrameVar.drop([colIndex1, colIndex2 ...], axis=1) : 열

In [103]:
df6 = pd.DataFrame(np.random.randn(5,5), 
                   columns=['col1','col2', 'col3','col4','col5'])
df6

       col1      col2      col3      col4      col5
0  1.059250 -1.221132 -2.322608  0.235846 -0.087701
1  0.358733  0.421650 -1.672256  1.313681  0.483541
2 -0.521921 -0.476728  1.548767  0.793581  0.897365
3  1.453262  0.156467 -1.323219 -0.825944  0.145907
4 -1.367055  0.652288  1.698142  1.024791 -0.597613

In [104]:
# 특정 컬럼 삭제 - 바로 데이타프레임에 적용 
del df6['col5']
df6

       col1      col2      col3      col4
0  1.059250 -1.221132 -2.322608  0.235846
1  0.358733  0.421650 -1.672256  1.313681
2 -0.521921 -0.476728  1.548767  0.793581
3  1.453262  0.156467 -1.323219 -0.825944
4 -1.367055  0.652288  1.698142  1.024791

In [105]:
#col3 삭제 
df6.drop('col3', axis=1)

       col1      col2      col4
0  1.059250 -1.221132  0.235846
1  0.358733  0.421650  1.313681
2 -0.521921 -0.476728  0.793581
3  1.453262  0.156467 -0.825944
4 -1.367055  0.652288  1.024791

In [106]:
df6

       col1      col2      col3      col4
0  1.059250 -1.221132 -2.322608  0.235846
1  0.358733  0.421650 -1.672256  1.313681
2 -0.521921 -0.476728  1.548767  0.793581
3  1.453262  0.156467 -1.323219 -0.825944
4 -1.367055  0.652288  1.698142  1.024791

In [107]:
df6 = df6.drop('col3', axis=1)

In [108]:
df6

       col1      col2      col4
0  1.059250 -1.221132  0.235846
1  0.358733  0.421650  1.313681
2 -0.521921 -0.476728  0.793581
3  1.453262  0.156467 -0.825944
4 -1.367055  0.652288  1.024791

In [109]:
# 하나의 행 삭제후 데이타프레임에 적용 
df6 = df6.drop(0)

In [110]:
df6

       col1      col2      col4
1  0.358733  0.421650  1.313681
2 -0.521921 -0.476728  0.793581
3  1.453262  0.156467 -0.825944
4 -1.367055  0.652288  1.024791

In [111]:
# 여러개의 행 삭제 
df6 = df6.drop([1,4])
df6

       col1      col2      col4
2 -0.521921 -0.476728  0.793581
3  1.453262  0.156467 -0.825944

In [112]:
# 구문오류
# df6 = df6.drop([2:4])

## 행 또는 열의 데이터 합 구하기

- dataframeVar.sum(axis=0) : 각각의 열의 합
- dataframeVar.sum(axis=1) : 각각의 행의 합

In [113]:
df7 = pd.DataFrame(np.random.randn(5,5), 
                   columns=['col1','col2', 'col3','col4','col5'])
df7

       col1      col2      col3      col4      col5
0 -1.730009  0.353757 -0.574874 -1.264851  0.989141
1  0.735040 -0.847464 -1.701007  0.604391 -0.836975
2  0.540118 -0.428208 -0.455285  0.306169  0.960899
3  1.389335 -1.521650  0.567851  1.151084  2.550988
4  0.115328 -0.641058 -0.670592 -0.757713 -1.893579

In [114]:
# 열의 합 (기본이 axis=0)
df7.sum()

col1    1.049813
col2   -3.084623
col3   -2.833907
col4    0.039080
col5    1.770474
dtype: float64

In [115]:
# 행의 합
df7.sum(axis=1)

0   -2.226837
1   -2.046014
2    0.923694
3    4.137608
4   -3.847614
dtype: float64

In [116]:
df7

       col1      col2      col3      col4      col5
0 -1.730009  0.353757 -0.574874 -1.264851  0.989141
1  0.735040 -0.847464 -1.701007  0.604391 -0.836975
2  0.540118 -0.428208 -0.455285  0.306169  0.960899
3  1.389335 -1.521650  0.567851  1.151084  2.550988
4  0.115328 -0.641058 -0.670592 -0.757713 -1.893579

In [117]:
# 특정 컬럼의 합
df7['col1'].sum()

1.049812865474439

In [118]:
# 특정 행의 합
df7.loc[1].sum()

-2.046013906796586

## 행 또는 열의 데이터 평균 구하기 

- dataframeVar.mean(axis=0) : 각각의 열의 평균
- dataframeVar.mean(axis=1) : 각각의 행의 평균

In [119]:
df7

       col1      col2      col3      col4      col5
0 -1.730009  0.353757 -0.574874 -1.264851  0.989141
1  0.735040 -0.847464 -1.701007  0.604391 -0.836975
2  0.540118 -0.428208 -0.455285  0.306169  0.960899
3  1.389335 -1.521650  0.567851  1.151084  2.550988
4  0.115328 -0.641058 -0.670592 -0.757713 -1.893579

In [120]:
# 열의 평균 (기본이 axis=0)
df7.mean()

col1    0.209963
col2   -0.616925
col3   -0.566781
col4    0.007816
col5    0.354095
dtype: float64

In [121]:
# 행의 평균
df7.mean(axis=1)

0   -0.445367
1   -0.409203
2    0.184739
3    0.827522
4   -0.769523
dtype: float64

## NaN 값을 제외하고 합 구하기

In [122]:
data = [[1.4, np.nan],
         [7.1, -4.5],
         [np.nan, np.nan],
         [0.75, -1.3]]
# 컬럼명과 행 인덱스 명 지정
df8 = pd.DataFrame(data, columns=["one","two"], index=["a", "b", "c", "d"])
df8

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [123]:
df8.sum()

one    9.25
two   -5.80
dtype: float64

In [124]:
# 결측값을 빼고 합 구하기 
df8.sum(skipna=True)

one    9.25
two   -5.80
dtype: float64

In [125]:
# 결측값을 넣고 합 구하기 
df8.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [126]:
# 결측값을 넣고 행의 합 구하기 
df8.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [127]:
# 결측값을 건너뛰고 행의 합 구하기 
df8.sum(axis=1, skipna=True)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

## 퀴즈

```
아래와 같은 데이타 프레임을 생성한 후 
np.NaN 값을 각 열의 평균값으로 대체하여라
```

In [128]:
data = [[1.4, np.nan, 3.3, np.nan],
        [7.1, -4.5, 2.4, 1.5],
        [np.nan, np.nan,0.75, -1.3],
        [0.75, -1.3, np.nan, 5.5]]

# 컬럼명과 행 인덱스 명 지정
df9 = pd.DataFrame(data, 
                   columns=["one","two", "three", "four"], 
                   index=["a", "b", "c", "d"])
df9

    one  two  three  four
a  1.40  NaN   3.30   NaN
b  7.10 -4.5   2.40   1.5
c   NaN  NaN   0.75  -1.3
d  0.75 -1.3    NaN   5.5

In [129]:
df9.mean(axis=0)

one      3.083333
two     -2.900000
three    2.150000
four     1.900000
dtype: float64

In [130]:
# 열의 평균값으로 NaN 값 채우기 
result = df9.fillna(value=df9.mean(axis=0))
result

        one  two  three  four
a  1.400000 -2.9   3.30   1.9
b  7.100000 -4.5   2.40   1.5
c  3.083333 -2.9   0.75  -1.3
d  0.750000 -1.3   2.15   5.5

In [131]:
# 소숫점 1자리까지 정리 
result2 = round(result,1)

In [132]:
result2

   one  two  three  four
a  1.4 -2.9    3.3   1.9
b  7.1 -4.5    2.4   1.5
c  3.1 -2.9    0.8  -1.3
d  0.8 -1.3    2.2   5.5